Repository: mozilla-l10n/mt-training-data
Catalog: dv/dv_pontoon.tmx
Source language: en_us
Languages: dv

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
dv: އަހަރެމެންގެ ބޭނުންވަނީ ރަށްފުށު ހިސާބަކުންނަމަވެސް މިފަދަ މިއަޑުން ބަހަށް ބަދަލު ކުރާ އިންޖީނަކަށް އިވިދާނެފަދަ ފަދަ ޒާތްޒާތުގެ އަޑުތައްވެސް ކޮމަން ވޮއަސް މައުލޫމާތު ކޮށާރުންފެނިގެން ދިއުމެވެ. އެހެންކަމުން އަހަރެމެން މިބަލަނީ ވީހާވެސް ގިނަ މިފަދަ ޒާތްޒާތުގެ އަޑުތައް ލިބޭތޯއެވެ. މިފަދަ ވާހަކަ ދެއްކުމުގެ އަޑުތަކުގެ އިތުރުން ތަފާތު ވައްތަރު ވައްތަރުގެ އަޑުތައް މިމައުލޫމާތު ކޮށާރުގައި އެކުލެވެންޏާ އަސްލު ދުނިޔޭގައިވާ ކާރުގެ އަޑުތަކާއި ވެށީގައިވާ ތަފާތު އަޑުތައް ދަސްކޮށް ދެނެގަތުމަށް މި އިންޖީނަށްއެނގޭނެއެވެ. ކޮންމެވެސްކަމެއް ދޭހަވާ ރެކޯޑިންއެއް ވެއްޖެއްޔާމުން މި މައުލޫމާތު ކޮށާރުށް ފުދޭނެއެވެ.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
dv: ތިބާގެ ބަސް ކޮމަން ވޮއިސްއަށް އެޅުމަށް ބޭނުންވާ އިތުރު މައުލޫމާތު ވަރަށް އަވަހަށް ފޯރުކޮށްދޭނަން

source: We will be in touch with more information as it becomes available.
dv: އިތުރު މަޢުލޫމާތު ލިބެމުން ދާ ވަރަކަށް އެ މަޢުލޫމާތުތައް ތިޔަ ފަރާތާއި ހިއްސާ ކުރަމުން ދާނަން.

source: We will not make your email public.
dv: ތިފަރާތުގެ އީމެއިލް އާންމުންނާއި ހިއްސާއެއްނުކުރާނަން

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
dv: ޑޭޓާސެޓުން ތިބާގެ އަޑުކޮޅުތައް ފޮހެލަން ތި އެދިލެއްވި އެދިލެއްވުން ބަލާނަމެވެ. ތި އެދިލެއްވުން ފާސްކުރެވޭނަމަ، ޑޭޓާސެޓް ޑައުންލޯޑު ކުރި ފަރާތްތަކަށް ތިބާގެ އަޑުކޮޅުތައް ފޮހެލަން ވެސް އަންގާނަމެވެ.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
dv: ކޮމަންވޮއިސް ޑޭޓާސެޓުގައި، ވާހަކަދައްކާ ފަރާތްތަކަކީ ކޮބައިކަން އަހަންނަށް ނޭންގޭނެއޭ ބުނުމުގެ މާނައަކީ ކޮބާ؟

source: What is Common Voice?
dv: ކޮމަންވޮއިސް އަކީ ކޮބާ؟

source: What level of audio quality is required for a voice clip to be used in the dataset?
dv: ބޭނުންހިފޭވަރުވާނީ، ކިހާ ފެންވަރެއްގައި އަޑުގެ ރެކޯޑިންގް ހުރެގެންތަ؟

source: What’s inside the Common Voice dataset?
dv: ކޮމަންވޮއިސް ޑޭޓާސެޓުގައި ހުރީ ކޮންއެއްޗެއް؟

source: What's Public?
dv: އާންމުންނަށް ހުޅުވާލެވޭނީ ކޯންޗެއް؟

source: What’s the difference between Common Voice and Deep Speech?
dv: ކޮމަންވޮއިސްއާއި، ޑީޕް ސްޕީޗްގެ ތަފާތަކީ ކޮބާ؟

source: When will you release Common Voice data in other languages?
dv: ކޮމަން ވޮއިސް ޑޭޓާ އެހެނިހެން ބަސްތަކުން ނެރޭނީ ކޮންއިރަކުން؟

source: Where does the source text come from?
dv: ލަފުޒުތަކުގެ އަސާސަކީ ކޮބާ؟

source: Why a profile?
dv: ވަނަވަރު ބޭނުންވަނީ ކީއްވެ؟

source: Why does this matter?
dv: މިކަން މުހިންމުވަނީ ކީއްވެ؟

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
dv: މީހުން ގާތު ފޮތުން ނުވަތް ވިކިޕީޑިއާ އާޓިކަލްއިން ކިޔުމަށް ނާހަނީ ކީއްވެ؟

source: Why do you need so many different speakers per language?
dv: ކޮންމެ ބަހުރުވައަކަށް އެހާގިނަ މީހުންގެ އަޑު ބޭނުންވަނީ ކީއްވެ؟

source: Why is 10,000 validated hours the per language goal for capturing audio?
dv: ކޮންމެ ބަހަކަށް 10،000 ގަޑިއިރުގެ އަޑު ރެކޯޑުކުރުމަށް އަމާޒުކުރުމުގެ ބޭނުމަކީކޮބާ؟

source: Why is Common Voice part of the Mozilla mission?
dv: މޮަޒިލާގެ މަސައްކަތުގައި ކޮމަންވޮއިސް ހިމެނެނީ ކީއްވެ؟

source: Why is it important?
dv: މިކަން މުހިންމުވަނީ ކީއްވެ؟

source: Why is my language not included yet?
dv: އަހަރެންގެ ބަސް އަދިވެސް ހިމަނާފައި ނުވަނީ ކީއްވެ؟

source: Why should I sign up for an account?
dv: އެކައުންޓެއް ހުޅުވަންވީ ކީއްވެ؟

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
dv: ތިބާގެ އަޑުކޮޅުތައް ފޮހެލަން ބޭނުންތަ، ނޫނީ ރަނގަޅީ ކޮމަންވޮއިސް ޑޭޓާސެޓުގައި ބެހައްޓަންތަ؟

source: y
dv: އ

source: Yes
dv: އާން

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
dv: އާދެ، އަހަންނަށް އީމެއިލް ފޮނުވާތި. އާންމު އަޑުގެ މަޝްރޫޢާ ބެހޭ ގޮތުން މަޢުލޫމާތު ލިބެން އަހަރެން ބޭނުން.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
dv: އާނ، އަހަންނަށް އީމެއިލް ފޮނުވާ. ކޮމަންވޮއިސްގައި މި ބަސް ކުރިއަރަމުންދާ މިންވަރާއި ބެހޭ ޚަބަރުތައް ލިބެން ބޭނުން.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
dv: އާދެ، ޚާއްޞަކޮށް ތިބާގެ އަޑު އެބަ ބޭނުންވޭ! ކޮމަންވޮއިސްގެ އަމާޒުގެ ތެރެއިން ބަޔަކީ، ވީހާވެސް ގިނަ ތަފާތު ބަހުރުވަތައް އެއްކޮށްގެން، އަޑު ދެނެގަންނަ ޚިދުމަތްތައް އެންމެންނަށް ހަމަހަމައަށް މަސައްކަތްކުރާ ގޮތް ހެދުމެވެ. މީގެ މާނައަކީ، މާދަރީ ބަހުގެ އަހުލުވެރިން ނޫން އެހެން ފަރާތްތަކުންދޭ އަޑުގެ ހަދިޔާތަކަކީ ވަކިން މުހިންމު ހަދިޔާތަކެކެވެ.

source: You
dv: ތިބާ

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
dv: ތިޔައުޅެނީ <size>{ $size } ގިގަބައިޓުގެ</size> އެއްޗެއް ޑައުންލޯޑުކުރަން. ކުރައަށް ދާންވީތަ؟

source: You are prepared to initiate a download of <b>{ $size }</b>
dv: <b>{ $size }</b> ގެ ޑައުންލޯޑެއް ފެއްޓުމަށް ތިބާ ތައްޔާރު

source: You can choose to make your username public or anonymous.
dv: އާންމުކޮށް ފެންނަގޮތަށް ނަންޖަހަން، ނުވަތަ ނުޖަހަން ހިޔާރުކުރެވޭނެ.

source: You must allow microphone access.
dv: މައިކު ބޭނުންކުރަން ހުއްދަދީ

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
dv: ސިއްރުން ހުށައެޅި ރިކޯރޑިންގް ކޮމަންވޮއިސްގެ ޑޭޓާ ސެޓުތަކުގައި ދެމި ހުންނާނެ. ވަނަވަރު ފޮހެލޮމަށްފަހު އަމިއްލަ ރިކޯރޑިންގްތައް ޑޭޓާސެޓުން ފޮހޮލުމަށް ނޭދެވޭނެ.

source: Your download has started.
dv: ޑައުންލޯޑުކުރަން ފަށައިފި

source: Your Languages
dv: އަހުރެންގެ ބަސްތައް

source: Your username and email will not be associated with the published data.
dv: ތިފަރާތުގެ ނަމާއި އީމެއިލް، އާންމުކޮށް ދޫކޮއްލާ މައުލޫމާތުތެރެއަކު ނުހިމެނޭނެ.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
dv: އާންމުއަޑަށް ތި އެހީވެދިނީ <goalPercentage></goalPercentage> ކޮންމެ ދުވަހެއްގެ { $goalValue } ރެކޯޑުކުރުމުގެ ލަނޑުދަނޑި ހާސިލު ކުރުމަށެވެ!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
dv: ކޮމަން ވޮއަސްއަށް މިހާސިލްވި<goalPercentage><goalPercentage> އަކީ ދުވަހުގެ { $goalValue } އަމާޒަށް ވާސިލް ވުމަ….؟

source: You've successfully signed up for contributing to { $language }. Thank you.
dv: { $language } ބަސް ކުރިއެރުވުމުގައި ބައިވެރިވުމުގެ ރެޖިސްޓްރޭށަން ފުރިހަމަވެއްޖެ. ޝުކުރިއްޔާ.
